#bin/bash
# 该脚本用于整个scene的数据传输，包含打包和传输

# 已经传输的数据
# 20230820_131402
# 20230820_105813
# 20230822_104856
# 20230822_110856
# 20230822_154430
# 20230823_110018
# 20230823_162939
# 20230824_115840
# 20230824_134824
# 20230826_102054
# 20230826_122208
# 20230830_120142
# 20230830_181107
# 20230831_101527
# 20230831_151057
# 20230901_123031
# 20230901_152553
# 20230902_142849
# 20231010_141702
# 20231027_185823
# 20231028_124504
# 20231028_134141
# 20231028_134843
# 20231028_150815
# 20231028_185150
# 20231029_195612
# 20231031_133418
# 20231031_134214
# 20231031_135230
# 20231101_160337
# 20231101_172858
# 20231102_144626
# 20231103_133206
# 20231103_140855
# 20231103_173838
# 20231103_174738
# 20231104_155224
# 20231105_161937
# 20231107_123645
# 20231107_152423
# 20231107_154446
# 20231107_183700
# 20231107_212029
# 20231108_143610
# 20231108_153013

scene_names="
        20230830_141232
        20230829_115909
        20230829_170053
        20230901_121703
        20230903_123057
        20231010_131855
        20231028_145730
        20231031_145557
        20231105_114621
        20231105_130142
        20231107_150715
        20231109_143452
        "
# 先把所有的数据都软连接到这个文件夹下，全部数据可能一个位置放不下
SOURCE_DIR="/mnt/ssd1/wuhan/prefusion/data/MV4D_12V3L"
num_cores=5

process_folder(){
    local scene_name=$1
    # 传数据
    tar --dereference -zcf "$scene_name.tar.gz" -C "$SOURCE_DIR" "$scene_name"
    rsync -avzP "$scene_name.tar.gz" wuhan@192.168.3.148:/share/home/wuhan/MV4D_12V3L/
    rm "$scene_name.tar.gz"
    # 传pkl
    rsync -avzP "$SOURCE_DIR/mv_4d_infos_$scene_name.pkl" wuhan@192.168.3.148:/share/home/wuhan/MV4D_12V3L/
    echo "$SOURCE_DIR/$scene_name"
}

for scene_name in $scene_names
do
    echo $scene_name
    process_folder "$scene_name" &
    
    ((job_count++))
    
    if [ $job_count -eq $num_cores ]; then
        wait -n
        ((job_count--))
    fi
done